class Patterns:

    """Паттерны для игры "Жизнь" (Game of Life)"""
    DOT = [1]

    STATIC_SQUARE = [ 1, 1,
                    1, 1]

    GLIDER = [ 0, 1, 0,
            0, 0, 1,
            1, 1, 1]

    BLINKER = [0, 0, 0,
            1, 1, 1,
            0, 0, 0]

    TOAD = [0, 0, 0, 0,
            0, 1, 1, 1,
            1, 1, 0, 0,
            0, 0, 0, 0]

    BEACON = [1, 1,
                1, 1]

    BOAT = [0, 1, 0, 0,
            1, 0, 1, 0,
            0, 1, 1, 0,
            0, 0, 0, 0]

    LOAFER = [0, 1, 0, 0,
            1, 0, 1, 0,
            0, 1, 1, 0,
            0, 0, 1, 0,
            0, 0, 0, 0]

    PULSAR = [
        0,0,1,1,1,0,0,0,1,1,1,0,0,
        0,0,0,0,0,0,0,0,0,0,0,0,0,
        1,0,0,0,0,1,0,1,0,0,0,0,1,
        1,0,0,0,0,1,0,1,0,0,0,0,1,
        1,0,0,0,0,1,0,1,0,0,0,0,1,
        0,0,1,1,1,0,0,0,1,1,1,0,0,
        0,0,0,0,0,0,0,0,0,0,0,0,0,
        0,0,1,1,1,0,0,0,1,1,1,0,0,
        1,0,0,0,0,1,0,1,0,0,0,0,1,
        1,0,0,0,0,1,0,1,0,0,0,0,1,
        1,0,0,0,0,1,0,1,0,0,0,0,1,
        0,0,0,0,0,0,0,0,0,0,0,0,0,
        0,0,1,1,1,0,0,0,1,1,1,0,0,
    ]

    LWSS = [
        0, 1, 1, 1, 1,
        1, 0, 0, 0, 1,
        0, 0, 0, 0, 1,
        1, 0, 0, 1, 0
    ]

    GOSPER_GLIDER_GUN = [0, 0, 0, 0, 0, 1, 0, 0, 0, 0,
                        0, 0, 0, 0, 0, 1, 0, 0, 0, 0,
                        0, 1, 1, 1, 0, 0, 0, 1, 1, 1,
                        0, 1, 1, 1, 0, 0, 0, 1, 1, 1,
                        0, 0, 0, 0]

    RPENTOMINO = [0, 1, 0,
                    0, 1, 1,
                    1, 1, 0]


    # Паттерны, которые будут использоваться в игре
    PATTERNS = {
        "dot": DOT,
        "glider": GLIDER,
        "blinker": BLINKER,
        "toad": TOAD,
        "beacon": BEACON,
        "boat": BOAT,
        "loafer": LOAFER,
        "pulsar": PULSAR,
        "lwss": LWSS,
        "gosper_glider_gun": GOSPER_GLIDER_GUN, # FIXME
        "rpentomino": RPENTOMINO
    }
    
    PATTERN_SIZES = {
        "dot": (1, 1),
        "glider": (3, 3),
        "blinker": (3, 3),
        "toad": (4, 4),
        "beacon": (2, 2),
        "boat": (4, 4),
        "loafer": (4, 5),  # 4 строки, 5 столбцов (20 элементов)
        "pulsar": (13, 13),
        "lwss": (4, 5),
        "gosper_glider_gun": (5, 10),  # 5 строк, 10 столбцов (50 элементов)
        "rpentomino": (3, 3)
    }
